idan2025/Rnode_Firmware/Seeed Studio/XIAO nRF52840 Wio-SX1262/RNode_Firmware/Boards.h
    #elif BOARD_MODEL == BOARD_HELTEC_T114
      #define MODEM SX1262
      #define HAS_EEPROM false
      #define HAS_DISPLAY true
      #define HAS_BLUETOOTH false
      #define HAS_BLE true
      #define HAS_CONSOLE false
      #define HAS_PMU true
      #define HAS_NP true
      #define HAS_SD false
      #define HAS_TCXO true
      #define HAS_BUSY true
      #define HAS_INPUT true
      #define HAS_SLEEP true
      #define DIO2_AS_RF_SWITCH true
      #define CONFIG_UART_BUFFER_SIZE 6144
      #define CONFIG_QUEUE_SIZE 6144
      #define CONFIG_QUEUE_MAX_LENGTH 200
      #define EEPROM_SIZE 296
      #define EEPROM_OFFSET EEPROM_SIZE-EEPROM_RESERVED
      #define BLE_MANUFACTURER "Heltec"
      #define BLE_MODEL "T114"

      #define PIN_T114_ADC_EN 6
      #define PIN_VEXT_EN 21

      // LED
      #define LED_T114_GREEN 3
      #define PIN_T114_LED 14
      #define NP_M 1
      const int pin_np = PIN_T114_LED;

      // SPI
      #define PIN_T114_MOSI 22
      #define PIN_T114_MISO 23
      #define PIN_T114_SCK  19
      #define PIN_T114_SS   24

      // SX1262
      #define PIN_T114_RST  25
      #define PIN_T114_DIO1 20
      #define PIN_T114_BUSY 17

      // TFT
      #define DISPLAY_SCALE 2
      #define PIN_T114_TFT_MOSI 9
      #define PIN_T114_TFT_MISO 11 // not connected
      #define PIN_T114_TFT_SCK 8
      #define PIN_T114_TFT_SS 11
      #define PIN_T114_TFT_DC 12
      #define PIN_T114_TFT_RST 2
      #define PIN_T114_TFT_EN 3
      #define PIN_T114_TFT_BLGT 15

      // pins for buttons on Heltec T114
      const int pin_btn_usr1 = 42;

      // pins for sx1262 on Heltec T114
      const int pin_reset = PIN_T114_RST;
      const int pin_cs = PIN_T114_SS;
      const int pin_sclk = PIN_T114_SCK;
      const int pin_mosi = PIN_T114_MOSI;
      const int pin_miso = PIN_T114_MISO;
      const int pin_busy = PIN_T114_BUSY;
      const int pin_dio = PIN_T114_DIO1;
      const int pin_led_rx = 35;
      const int pin_led_tx = 35;
      const int pin_tcxo_enable = -1;

      // pins for ST7789 display on Heltec T114
      const int DISPLAY_DC = PIN_T114_TFT_DC;
      const int DISPLAY_CS = PIN_T114_TFT_SS;
      const int DISPLAY_MISO = PIN_T114_TFT_MISO;
      const int DISPLAY_MOSI = PIN_T114_TFT_MOSI;
      const int DISPLAY_CLK = PIN_T114_TFT_SCK;
      const int DISPLAY_BL_PIN = PIN_T114_TFT_BLGT;
      const int DISPLAY_RST = PIN_T114_TFT_RST;

    #elif BOARD_MODEL == BOARD_T1000E
      // Seeed SenseCAP Wio Tracker T1000-E
      // nRF52840 + Semtech LR1110
      // Pin mapping sourced from Seeed's official Arduino BSP
      // (Seeed-Studio/Adafruit_nRF52_Arduino, variant
      // Seeed_Tracker_T1000_E_LoRaWAN and the LBM_T1000E library)
      #define MODEM LR1110
      #define HAS_EEPROM false
      #define HAS_DISPLAY false
      #define HAS_BLUETOOTH false
      #define HAS_BLE true
      #define HAS_CONSOLE false
      #define HAS_PMU false
      #define HAS_NP false
      #define HAS_SD false
      #define HAS_TCXO true
      #define HAS_BUSY true
      #define HAS_INPUT true
      #define HAS_SLEEP true
      #define CONFIG_UART_BUFFER_SIZE 6144
      #define CONFIG_QUEUE_SIZE 6144
      #define CONFIG_QUEUE_MAX_LENGTH 200
      #define EEPROM_SIZE 296
      #define EEPROM_OFFSET EEPROM_SIZE-EEPROM_RESERVED
      #define BLE_MANUFACTURER "Seeed"
      #define BLE_MODEL "T1000-E"

      // Button
      const int pin_btn_usr1 = 6;  // PIN_BUTTON1

      // LEDs
      const int pin_led_rx = 24;   // LED_GREEN
      const int pin_led_tx = 3;    // LED_RED

      // LR1110 SPI and control pins. The RF switch and TCXO on this
      // board are controlled internally by the LR1110 via system
      // commands (set_dio_as_rf_switch / set_tcxo_mode), not by
      // dedicated MCU GPIOs, so no rxen/txen/tcxo_enable pins exist.
      const int pin_cs = 12;       // PIN_SPI_CS
      const int pin_sclk = 11;     // PIN_SPI_SCK
      const int pin_mosi = 41;     // PIN_SPI_MOSI
      const int pin_miso = 40;     // PIN_SPI_MISO
      const int pin_busy = 7;      // LR1110_BUSY_PIN
      const int pin_dio = 33;      // LR1110_IRQ_PIN
      const int pin_reset = 42;    // LR1110_NRESET_PIN
      const int pin_tcxo_enable = -1;

      // Battery / VBUS sense ADC pins (not yet exposed over KISS,
      // kept here for future use)
      const int pin_vbat = 2;      // A0, battery level divider
      const int pin_vcc = 4;       // A1, VCC voltage divider
      const int pin_vchg = 5;      // A2, charger insert detect

    #elif BOARD_MODEL == BOARD_XIAO_NRF52
      // Seeed XIAO nRF52840 + Wio-SX1262 for XIAO (kit SKU 102010710)
      // nRF52840 + Semtech SX1262. Wiring from Seeed's "Wio-SX1262 for XIAO"
      // schematic (V1.0), cross-checked against Meshtastic's validated
      // seeed_xiao_nrf52840_kit variant. XIAO D-labels -> nRF52840 GPIO:
      //   D1=GPIO1 D2=GPIO2 D3=GPIO3 D4=GPIO4 D5=GPIO5
      //   D8=GPIO8(SCK) D9=GPIO9(MISO) D10=GPIO10(MOSI)
      // RF switch: RX side on D5 (pin_rxen); TX side driven by SX1262 DIO2.
      // TCXO: on SX1262 DIO3 at 1.8V (see sx126x::enableTCXO()).
      #define MODEM SX1262
      #define HAS_EEPROM false
      #define HAS_DISPLAY false
      #define HAS_BLUETOOTH false
      // BLE OFF by default: Bluefruit.begin() wedges on this board (SD re-enable
      // hang), so the radio+USB path is shipped BLE-less. setup() calls
      // sd_softdevice_disable() before eeprom_begin so InternalFS uses the
      // direct-NVMC flash path (patched flash_nrf5x.c). USB-CDC serial is the
      // only transport.
      #define HAS_BLE false
      #define HAS_CONSOLE false
      #define HAS_PMU false
      #define HAS_NP false
      #define HAS_SD false
      #define HAS_TCXO true
      #define HAS_RF_SWITCH_RX_TX true
      #define HAS_BUSY true
      #define HAS_INPUT false
      #define HAS_SLEEP false
      #define DIO2_AS_RF_SWITCH true
      #define CONFIG_UART_BUFFER_SIZE 6144
      #define CONFIG_QUEUE_SIZE 6144
      #define CONFIG_QUEUE_MAX_LENGTH 200
      #define EEPROM_SIZE 296
      #define EEPROM_OFFSET EEPROM_SIZE-EEPROM_RESERVED
      #define BLE_MANUFACTURER "Seeed"
      #define BLE_MODEL "XIAO-SX1262"

