idan2025/Rnode_Firmware/Seeed Studio/XIAO nRF52840 Wio-SX1262/RNode_Firmware/Boards.h
      const int pin_btn_usr1 = -1; // XIAO nRF52840 (non-Sense) has no user button

      // SX1262 control + SPI pins (XIAO nRF52840 GPIO numbers)
      const int pin_rxen = 5;      // D5  RF switch RX enable
      const int pin_txen = -1;     // TX side driven by SX1262 DIO2
      const int pin_reset = 2;     // D2  NRST
      const int pin_cs = 4;        // D4  NSS
      const int pin_sclk = 8;      // D8  SCK
      const int pin_mosi = 10;     // D10 MOSI
      const int pin_miso = 9;      // D9  MISO
      const int pin_busy = 3;      // D3  BUSY
      const int pin_dio = 1;       // D1  DIO1 (IRQ)
      const int pin_led_rx = LED_GREEN;  // GPIO13 (active low) - green blinks on RX
      const int pin_led_tx = LED_GREEN;  // GPIO13 (active low) - green blinks on TX
      const int pin_tcxo_enable = -1;    // TCXO powered via SX1262 DIO3

    #else
      #error An unsupported nRF board was selected. Cannot compile RNode firmware.
    #endif

  #endif

  #ifndef DISPLAY_SCALE
    #define DISPLAY_SCALE 1
  #endif

  #ifndef HAS_RF_SWITCH_RX_TX
    const int pin_rxen = -1;
    const int pin_txen = -1;
  #endif

  #ifndef HAS_BUSY
    const int pin_busy = -1;
  #endif

  #ifndef LED_ON
    #define LED_ON HIGH
  #endif
  
  #ifndef LED_OFF
    #define LED_OFF LOW
  #endif

  #ifndef DIO2_AS_RF_SWITCH
    #define DIO2_AS_RF_SWITCH false
  #endif

  // Default OCP value if not specified
  // in board configuration
  #ifndef OCP_TUNED
    #define OCP_TUNED 0x28
  #endif

  #ifndef NP_M
    #define NP_M 0.15
  #endif

#endif
